# 먼저 scipy를 설치해야 함.

import numpy as np
from   numpy import poly1d

Poly= [ poly1d([ 1, 0, 1]),  # x^2+1
        poly1d([ 1,-2,-1]),
        poly1d([-1, 0, 0,-1]),
        poly1d([ 1, 1, 0, 1, -1]),
        poly1d([-1, 0, 0, 1, 1,-1]),
        poly1d([ 7,12, 9,-7, 3, 9, 1, 8, 7]),
        poly1d([-5,-1, 2,-6,-5, 4, 3,-8, 4,10]),
        poly1d([-3, 1, 3, 5, 5,-4, 3, 2, 0, 1]),
        poly1d([ 3,-5,-1, 2,-6,-5, 4, 3,-8, 4, 5]),
        poly1d([ 5, 2, 5, 1, 2, 6, 3,-4, 4, 3,-8, 4,10]),
        poly1d([ 3,-5, 2, 1, 0, 0,-6,-5, 4, 3,-8, 4, 5]),
        poly1d([-2,-3, 5,-2,-1, 0, 0, 6, 5,-4,-3, 8,-4, 1]),
         ]


B = poly1d([0])  # B[x]=0

for i,w in enumerate(Poly) :
    B += w
    print(f"> i={i+1:2} B.c={B.c}")


