

# hwp에서 바꾼 한자를 넣어서 실험을 함.

import re

text1 = """
test content☆漢字〓韓國外交部對外稱, 應美方要求，
韓國貿易部長,金宗塤和美國貿易代表,施瓦布本週一
下午還?行了一個「非正式磋商」。end◆
日語〓慰謝料としてフルハウス(Full House)
え ぉ お か が き ぎ くぐけげこごさ ざ し じ す ず せ
をあげるというィヨンジェの言葉に,ジウンは?ても?る事ができないで?む。end
◆ 한글〓해쉬(Hash)값 필터링 시스템(Filtering system)은 디지털 파일에 고유의
키 값을 매겨서 등록, 관리하는 것으로 저작권 침해 신고가 접수됐을 경우
이 키 값을 기준으로 검색, 침해 여부를 판단할 수 있는
방식이다. end★
"""

text2 = """
康京和外相は9日、慰安婦問題をめぐる日韓政府間合意について記
者会見し、合意に基づき日本政府が
拠出した10億円について、韓国政府が予算で負担する
考えを表明した。(時事通信)
"""


text3 = 'I am from 美国。We should 曹操 be friends. 朋友。'

for n in re.findall(r'[\u4e00-\u9fff]+', text1):
    print(n)