#-------------------------------------------------------------------------------
# Author:      Zoh
# Created:     2020-04-12
#-------------------------------------------------------------------------------

sname = ['여척두', '팽길탄', "방복동",   "이명봑" ]
age  = [ 56,         34,       56,            76 ]
job  = ["개장수", '소장수',  "학생", "전직대통령"]




for ( wname, wage, wjob) in zip( sname, age, job) :
    print("----------------------------")
    letter = (
    f'\n 존경하는 { wname } 선생님, 안녕하신지요.'
    f'\n 이번 {wage}-살됨을 축하드립니다. '
    f'\n 선생님의 직업 {wjob}을 위한 좋은 보험이 출시.....'
    )
    print(letter)

