#-------------------------------------------------------------------------------
# Purpose:     2019 Power Python
# Author:      Cho
#-------------------------------------------------------------------------------
C="""
파이썬에서 언더스코어(_)는 다음과 같은 상황에서 사용되는데 크게 5가지의 경우가 있다.

    인터프리터(Interpreter)에서 마지막 값을 저장할 때
    값을 무시하고 싶을 때 (흔히 “I don’t care”라고 부른다.)
    변수나 함수명에 특별한 의미 또는 기능을 부여하고자 할 때
    국제화(Internationalization, i18n)/지역화(Localization, l10n) 함수로써 사용할 때
    숫자 리터럴값의 자릿수 구분을 위한 구분자로써 사용할 때
"""
def do_something():
    print(" *", end= " ")

# 언패킹시 특정값을 무시
x, _, y = (1, 2, 3) # x = 1, y = 3

# 여러개의 값 무시
x, *_, y = (1, 2, 3, 4, 5) # x = 1, y = 5

# 인덱스 무시
for _ in range(10):
    do_something()

# 특정 위치의 값 무시

Ltu= tuple("Computer")
for _, val in enumerate(Ltu):
    do_something()