#-------------------------------------------------------------------------------
# Name:        module1
# Author:      algor
# Created:     16-03-2022
#-------------------------------------------------------------------------------

a = [1,2,3]
b = a
c = [1,2,3]

print("step 10", a is b)
print("step 20",a is c )
print("step 30",a == c )

#is는 지적하는 객체가 동일한 것인지의 여부
#==는 값이 같은지의 여부

s1="메롱"
s2="메롱"
print("step 40",s1 is s2)

n1 = 30
n2 = 29 + 1
print("step 50",n1 is n2)

D1={}
D2={}
print("step 60",D1 is D2)
print("step 70",D1 == D2)

