#-------------------------------------------------------------------------------
# 1/10 = 0b0.0001100110011001100110011001100110011001100110011...

from decimal import Decimal

x = 1.0/10.0
print(x , bin( int(x*1000000000)))

fr = 3.0 / 13.0
print("1: ", fr, round(fr, 3))

print("2: ", 0.1 + 0.3)  #이것을 console에서 출력해 봅시다.

p = round(2.672891, 3)
print("3: 올림값 표현 p = ", p)


print("4: 저장된 십진수 표현 = ", Decimal(2.675))


x = 3.14159
print("6: ", x.as_integer_ratio()) # (3537115888337719, 1125899906842624)


print("7: ",  x == 3537115888337719 / 1125899906842624)
#                  3537115888337719  / 1125899906842624

myf = 3456.209709242049702
print(myf)
print("%10.1f" % myf)
print("%10.2f" % myf)
print("%10.3f" % myf)
print("%10.4f" % myf)
print("%5.3f" % myf)


f2 = format(0.1, '.17f') # '0.10000000000000001'
# f2는 숫자가 아니고 문자입니다. 조심 !!!!!

print(f2)
print(format(0.3, '.27f')) # '0.10000000000000001'



