#-------------------------------------------------------------------------------
# Purpose:     2021 Prof. Zoh's Work     롯데 만만세
# Author:      Cho
# Created:     2021-04-02
#-------------------------------------------------------------------------------

Alba = [ [], [5, 7], [11,15,23], [], [], [], [23], [], [2,7 ], [], [] , [25] ]


for (i,w) in enumerate(Alba) :
#    print(f' 달 {i+1:3}, {w} ')
    if len(w) == 0 :
        print( f"{i+1}달은 완전근무")

freedays= 0
for (i,w) in enumerate(Alba) :
#    print(f' 달 {i+1:3}, {w} ')
    if len(w) != 0 :
        freedays += len(w)
        print( f"{i+1}달은 빠진 달 {w}")