#-------------------------------------------------------------------------------
# Purpose:     2022 Zoh's Work     "過猶不及" 메롱..
# Author:      Cho
# Created:     2022-03-24
#-------------------------------------------------------------------------------

def dubeon(x,y):
    return(x*x + y*y)


def tritype( L ) :
    if L[0]+ L[1] < L[2]:
        return("삼각형아님")
    s1 =dubeon( L[0], L[1])
    s2 = L[2]**2
    if s1 == s2 : return("직각")
    if s1 < s2  : return("둔각")
    if s1 > s2  : return("예각")



U=[ [10, 20, 30],[3, 4, 5], [56, 67, 89],[30, 30, 30]]

for w in U :
    print(w, tritype(w))