#-------------------------------------------------------------------------------
# Purpose:     2021 Prof. Zoh's Work     롯데 만만세
# Author:      Cho
# Created:     2021-03-23
#-------------------------------------------------------------------------------

BAD = list("개똥쫑뽕빵말코졸")



while( True ) :
    w = input("의문나는 문자를 입력하시오: ")
    if w in BAD :
        print("당신의 글자= [ ", w , "]는 나쁜 문자입니다")
    else :
        print("당신의 글자= [ ", w , "는 사용가능 글자입니다.")
    if w == "끝" :
        print("이제 작업을 종료합니다")
        break