

a = 91
b = 15
print(a/b)
print("연습 1" , 15/14)
print("연습 2" , 15.0/14)
print("연습 3" , 15/14.0)
print("연습 4" , 15 + 14)
print("연습 5" , 15.0 + 14)
print("연습 6" , 15   ** 4)
print("연습 7" , 15.0 ** 4)
print("연습 8" , 15   ** 4.0)

# ---------- mod ------------------------
print("mod 1" ,  5  %  3)
print("mod 2" ,  5  % -3)
print("mod 3" , -5  %  3)
print("mod 4" , -5  % -3)
print("mod 5" , 133 % 11)
print("mod 6" , 157 % 7)   # 0으로 mod를 하면 어떤 일이 벌어질까요


# ---------- 연산자의 순위 ---------------
print("복잡한 연산의 결과 출력" , 2 / 4 / 6 -  5 + 6 * 2 - 5 ** 2 +  5  %  3 - 1)
print()

# --------- 관계 연산 --------
print("실험 3-1",  124 < 39)
print("실험 3-2", 124 != 123)
print("실험 3-3", (10, 3, 2) > (5,5,5))
print("실험 3-4", "가가" > "각가")
print("실험 3-5", "abcd" > "bbcd")